{
  "title": "Why us?",
  "items": [
    {
      "id": 1,
      "title": "Availability",
      "text": "A dedicated partner will be involved for every transaction and be available at all times to cater to the needs of our Clients."
    },
    {
      "id": 2,
      "title": "Partnership",
      "text": "Our aim is to foster collaboration with inhouse legal teams and business teams to understand the pain points and bottlenecks and provide custom-made solutions with quick turnaround times. We proactively provide updates on rapidly changing laws which may affect our client’s business and assist in undertaking risk mitigation measures."
    },
    {
      "id": 3,
      "title": "Practicality",
      "text": "We put business and practicality first while working on Client issues.   We focus on bringing synergy between law, practicality  and business to come up with innovative solutions which suit the needs of our Clients. We provide solutions which are simple and easy to implement and which are acceptable under law."
    },
    {
      "id": 4,
      "title": "Customisation",
      "text": "We understand that one size does not fit all. Hence, our solutions are tailor made to suit the Client specific needs.  Our vast experience in our areas of practice helps us to come up with multiple solutions to pick from."
    },
    {
      "id": 5,
      "title": "Responsiveness",
      "text": "We value our client’s business and understand the importance of quick turnaround times and its impact on business.. We work with our Clients to adhere to their timelines for best results."
    },
    {
      "id": 6,
      "title": "Cost effectiveness",
      "text": "In our quest to collaborate with inhouse legal teams, it is our endeavour to work with them to find the most cost effective price structure which suits their budget."
    },
    {
      "id": 7,
      "title": "Quality Work",
      "text": "We do not compromise on quality. We are committed to maintaining the highest standards of  quality of work at all times."
    }
  ]
}
